---
kind: method
id: M:Autodesk.Revit.DB.Transform2D.Dispose
source: html/e709cdf9-9203-9272-3c6c-fe5dfa90fbce.htm
---
# Autodesk.Revit.DB.Transform2D.Dispose Method

Releases all resources used by the Transform2D

## Syntax (C#)
```csharp
public void Dispose()
```